//  Longest Consecutive Sequence
// Дан массив целых чисел nums. Вернуть длину самой длинной последовательности подряд идущих целых, которую можно составить из элементов массива.
// Последовательность подряд идущих чисел — это такая последовательность, где каждое следующее число на 1 больше предыдущего. Элементы не обязаны идти подряд в исходном массиве.
// Требование: алгоритм должен работать за O(n) времени.

// Пример:
// Ввод: nums = [2, 20, 4, 10, 3, 4, 5]
// Вывод: 4

// Пояснение: самая длинная последовательность подряд идущих чисел — [2, 3, 4, 5].